output/posts/emacs/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>emacs | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/emacs/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../vimrc/" title="vimrc: vim配置文件" type="text/html">
<link rel="next" href="../ffmpeg/" title="ffmpeg" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="emacs">
<meta property="og:url" content="https://chimez.github.io/posts/emacs/">
<meta property="og:description" content="从源码编译安装



查看特性


查看 system-configuration-features 中的信息





查看编译选项


查看 system-configuration-options 中的信息


   ./configure --without-compress-install --with-modules 'CFLAGS=-O2 -g3'







在正则表达式中使用l">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-01-26T18:28:36+08:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="linux">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">emacs</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-01-26T18:28:36+08:00" itemprop="datePublished" title="2021-01-26 18:28">2021-01-26 18:28</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org7135aa8" class="outline-2">
<h2 id="org7135aa8">从源码编译安装</h2>
<div class="outline-text-2" id="text-org7135aa8">
</div>
<div id="outline-container-orgfd5be86" class="outline-3">
<h3 id="orgfd5be86">查看特性</h3>
<div class="outline-text-3" id="text-orgfd5be86">
<ol class="org-ol">
<li>查看 <code>system-configuration-features</code> 中的信息</li>
</ol>
</div>
</div>

<div id="outline-container-orgf466d79" class="outline-3">
<h3 id="orgf466d79">查看编译选项</h3>
<div class="outline-text-3" id="text-orgf466d79">
<ol class="org-ol">
<li>查看 <code>system-configuration-options</code> 中的信息</li>
</ol>
<div class="highlight"><pre><span></span>   ./configure --without-compress-install --with-modules 'CFLAGS=-O2 -g3'
</pre></div>
</div>
</div>
</div>


<div id="outline-container-org626cf43" class="outline-2">
<h2 id="org626cf43">在正则表达式中使用lisp代码</h2>
<div class="outline-text-2" id="text-org626cf43">
<p>
使用 <code>\,</code> 后加一个表达式
</p>
<div class="highlight"><pre><span></span>  <span class="nv">:s/</span><span class="err">\</span><span class="p">(</span><span class="o">.</span><span class="nv">*?</span><span class="err">\</span><span class="p">)</span><span class="nv">a</span><span class="err">\</span><span class="p">(</span><span class="o">.</span><span class="nv">*?</span><span class="err">\</span><span class="p">)</span><span class="nv">b/</span><span class="err">\</span><span class="mi">1</span><span class="err">\</span><span class="o">,</span><span class="p">(</span><span class="nb">+ </span><span class="p">(</span><span class="nf">string-to-number</span> <span class="err">\</span><span class="mi">2</span><span class="p">)</span> <span class="mi">100</span><span class="p">)</span><span class="nv">/</span>
</pre></div>
</div>
</div>


<div id="outline-container-org063939f" class="outline-2">
<h2 id="org063939f">正则表达式的非贪心匹配</h2>
<div class="outline-text-2" id="text-org063939f">
<p>
non greedy regex
星号后加问号
</p>
<div class="highlight"><pre><span></span>:s/.*?//
</pre></div>
</div>
</div>


<div id="outline-container-org0a2b763" class="outline-2">
<h2 id="org0a2b763">文件编码问题</h2>
<div class="outline-text-2" id="text-org0a2b763">
</div>
<div id="outline-container-org8d80786" class="outline-3">
<h3 id="org8d80786">改变显示文件编码,解决乱码问题</h3>
<div class="outline-text-3" id="text-org8d80786">
<p>
使用命令
</p>
<div class="highlight"><pre><span></span>   <span class="nv">revert-buffer-with-file-coding-system</span>
</pre></div>
</div>
</div>

<div id="outline-container-orga4100bf" class="outline-3">
<h3 id="orga4100bf">修改编码</h3>
<div class="outline-text-3" id="text-orga4100bf">
<p>
在按下 <code>M-x</code> 后使用命令改变编码再保存即可
</p>
<div class="highlight"><pre><span></span>   <span class="nv">set-buffer-file-coding-system</span>
</pre></div>
</div>
</div>

<div id="outline-container-org794bc55" class="outline-3">
<h3 id="org794bc55">常见的编码</h3>
<div class="outline-text-3" id="text-org794bc55">
<ol class="org-ol">
<li>中文
<ol class="org-ol">
<li>cp936</li>
<li>gb2312</li>
<li>gb18030</li>
</ol>
</li>
<li>日文
<ol class="org-ol">
<li>cp932</li>
</ol>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgf975755" class="outline-2">
<h2 id="orgf975755">对齐排版代码</h2>
<div class="outline-text-2" id="text-orgf975755">
<p>
使用 <code>align-regexp, sort-regexp-fields, sort-columns</code>
</p>
</div>
</div>


<div id="outline-container-org5287680" class="outline-2">
<h2 id="org5287680">Tramp 远程编辑</h2>
<div class="outline-text-2" id="text-org5287680">
</div>
<div id="outline-container-org462a652" class="outline-3">
<h3 id="org462a652">配置 ssh</h3>
<div class="outline-text-3" id="text-org462a652">
<p>
注意 tramp 的远程登陆只支持 bash, 不支持 zsh, 所以要进行设置，tramp 登陆用 <code>namebash</code>, ssh 登陆用 <code>namezsh</code> 就行了
</p>

<p>
文件 <code>$HOME/.ssh/config</code>
</p>
<div class="highlight"><pre><span></span>   Host namebash
       HostName 10.0.0.1
       User username
       RequestTTY yes
       RemoteCommand bash

   Host namezsh
       HostName 10.0.0.1
       User username
       RequestTTY yes
       RemoteCommand zsh
</pre></div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/emacs/" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../../categories/linux/" rel="tag">linux</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../vimrc/" rel="prev" title="vimrc: vim配置文件">Previous post</a>
            </li>
            <li class="next">
                <a href="../ffmpeg/" rel="next" title="ffmpeg">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
